Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/consumer_affairs/consumer_protection/consumer_complaints/consumer_complaints.html.txt.tmx
Source language: en
Languages: ga

source: The rights of consumers of goods and services are protected by law
ga: In Éirinn, cosnaítear cearta tomhaltóirí i dtaca le hearraí agus seirbhísí ag an dlí

source: The Competition and Consumer Protection Commission (CCPC) is an independent body, established on 31 October 2014 under the Competition and Consumer Protection Act 2014, with responsiblity for providing advice and information to consumers
ga: Oifig neamhspleách iad an Coimisiún um Iomaíocht agus Cosaint Tomhaltóirí (CCPC) atá freagrach as comhairle agus faisnéis a chur ar fáil do thomhaltóirí

source: In addition, the CCPC is responsible for the enforcement of a wide range of consumer protection laws
ga: Sa mhullach air sin, tá an CCPC freagrach as réimse fairsing dlíthe um chosaint tomhaltóirí a fhorfheidhmiú

source: Some of these consumer protection laws include:
ga: I measc cuid de na dlíthe um chosaint tomhaltóirí tá:

source: • laws on deceptive trading practices,
ga: • dlíthe ar chleachtais mhealltacha trádála,

source: • consumer safety, (mandatory standards),
ga: • sábháilteacht tomhaltóirí, (caighdeáin éigeantacha),

source: The CCPC does not have a supervisory role in relation to financial services; this area is covered by the Central Bank of Ireland
ga: Níl feidhm mhaoirseachta ag an CCPC maidir le seirbhísí airgeadais; cuimsíonn Banc Ceannais na hÉireann an limistéar seo

source: You may complain to the CCPC about false or misleading claims about goods, services and prices and the CCPC may prosecute the traders concerned or apply for a court order to get misleading advertisements withdrawn or amended
ga: Féadfaidh tú gearán a dhéanamh leis an CCPC faoi éilimh bhréagacha nó mhíthreoracha faoi earraí, seirbhísí agus praghsanna agus féadfaidh an CCPC na trádálaithe lena mbaineann a ionchúiseamh nó iarratas a dhéanamh ar ordú cúirte go mbainfear nó go leasófar fógraí míthreoracha

source: The CCPC does not have a role in obtaining redress for you but sometimes, if a trader is fined, the fine may be awarded to you
ga: Níl sé d’fheidhm ag an CCPC chun sásamh a bhaint amach duit, ach corruair, má ghearrtar fíneáil ar thrádálaí, d’fhéadfaí an fhíneáil a bhronnadh ort

source: If you suffer a loss or damage as a result of a false or misleading claim about goods or services, you should seek redress from the trader and, if necessary, you may sue for damages in the normal way through the courts
ga: Má bhíonn tú thíos le caillteanas nó damáiste mar thoradh ar éileamh bréagach nó míthreorach faoi earraí nó seirbhísí, ba cheart duit sásamh a lorg ón trádálaí agus, más gá, féadfaidh tú agair a dhéanamh le haghaidh damáistí ar an ngnáthbhealach trí na cúirteanna

source: The CCPC monitors the Sale of Goods and Supply of Services Act, 1980 and may prosecute traders for breaches of the law
ga: Déanann an CCPC monatóireacht ar an Acht um Dhíol Earraí agus Soláthar Seirbhísí, 1980 agus féadfaidh siad trádálaithe a ionchúiseamh mar gheall ar shárú an dlí

source: This Act gives you various rights in respect of the goods or services that you buy or rent for private use, e.g., you are entitled to expect that the goods are of merchantable quality, fit for their purpose, etc
ga: Tugann an tAcht seo cearta éagsúla maidir le hearraí nó seirbhísí a cheannaíonn tú nó a fhaigheann tú ar cíos lena n-úsáid ar bhonn príobháideach, e.g. tá sé de cheart agat bheith ag súil leis go mbaineann na hearraí caighdeáin indíolta amach, agus go n-oireann siad dá gcuspóir, etc

source: If the goods do not meet these requirements, it is up to the seller to put matters right
ga: Mura gcomhlíonann na hearraí na riachtanais seo, is faoin díoltóir atá sé na hábhair a chur ina gceart

source: The seller may then pursue the manufacturer but that is a matter between the seller and the manufacturer
ga: Féadfaidh an díoltóir, ansin, dul sa tóir ar an déantúsóir, ach is ábhar é sin a bheidh idir an díoltóir agus an déantúsóir

source: You as the consumer have rights against the seller and the seller has the duty to rectify the matter
ga: Tá cearta agat, mar an tomhaltóir, i leith an díoltóra agus tá ar an díoltóir an dualgas chun an t-ábhar a chur ina cheart

source: You must pursue this yourself, if necessary through the courts
ga: Ní mór duit tabhairt faoi seo tú féin, agus más gá, trí na cúirteanna

source: European Consumer Centre (ECC)
ga: An Lárionad Eorpach do Thomhaltóirí (ECC)

source: ECC Ireland provides a free information and advice service on consumer rights under EU law
ga: Cuireann an ECC Éire seirbhís faisnéise agus comhairle saor in aisce ar fáil ar chearta tomhaltóirí faoi dhlí an AE

source: ECC Ireland can also help solve cross-border disputes regarding goods and services
ga: Féadfaidh an ECC Éire cabhrú chun díospóidí trasteorann a réiteach i dtaca le hearraí agus seirbhísí chomh maith

source: It is part of an EU-wide network and is jointly financed by the Competition and Consumer Protection Commission and the European Commission
ga: Tá siad mar chuid den líonra atá ar fud an AE agus déanann an Coimisiún um Iomaíocht agus Cosaint Tomhaltóirí agus an Coimisiún Eorpach iad a chomh-mhaoiniú

source: Read more about consumer rights and cross-border shopping in the EU here
ga: Is féidir leat níos mó a léamh faoi chearta tomhaltóirí agus faoi shiopadóireacht trasteorann san AE anseo
